Catalogs/ТипыПодписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТипыПодписей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияПодписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активности</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловияДоп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/УсловияПодписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>УсловияПодписей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипСкидкиНаценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоГостей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыПодписей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	Если (Объект.Условие = Перечисления.УсловияПодписей.КоличествоГостей) ИЛИ
		(Объект.Условие = Перечисления.УсловияПодписей.Сумма) Тогда
		Элементы.ЗначениеУсловия.Заголовок = "От";
		Элементы.ЗначениеУсловияДоп.Заголовок = "До";
		Элементы.ЗначениеУсловия.РастягиватьПоГоризонтали = Ложь;
		Элементы.ЗначениеУсловияДоп.РастягиватьПоГоризонтали = Ложь;
		Элементы.ЗначениеУсловия.Видимость = Истина;
		Элементы.ЗначениеУсловияДоп.Видимость = Истина;
		Элементы.Приоритет.Видимость = Истина;
	ИначеЕсли (Объект.Условие = Перечисления.УсловияПодписей.БезУсловий) Тогда
		Элементы.ЗначениеУсловия.Видимость = Ложь;
		Элементы.ЗначениеУсловияДоп.Видимость = Ложь;
		Элементы.Приоритет.Видимость = Истина;
	ИначеЕсли (Объект.Условие = Перечисления.УсловияПодписей.ДисконтнаяКарта) Тогда
		Элементы.ЗначениеУсловия.Видимость = Истина;
		Элементы.ЗначениеУсловияДоп.Видимость = Ложь;
		Элементы.Приоритет.Видимость = Ложь;
	Иначе
		Элементы.ЗначениеУсловия.Заголовок = "Значение";
		Элементы.ЗначениеУсловия.РастягиватьПоГоризонтали = Истина;
		Элементы.ЗначениеУсловия.Видимость = Истина;
		Элементы.ЗначениеУсловияДоп.Видимость = Ложь;
		Элементы.Приоритет.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ЗначениеУсловия.ОграничениеТипа = Справочники.ТипыПодписей.ОписаниеТипаЗначенияУсловия(Объект);
	
КонецПроцедуры // УстановитьВидимостьНаСервере()

&НаКлиенте
Процедура УсловиеПриИзменении(Элемент)
	
	УсловиеПриИзмененииНаСервере();
	
КонецПроцедуры // // УсловиеПриИзменении()

&НаСервере
Процедура УсловиеПриИзмененииНаСервере()
	
	// Условие.
	Объект.Условие = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Объект.Условие, ПредопределенноеЗначение("Перечисление.УсловияПодписей.БезУсловий"));
	
	// ЗначениеУсловия
	Объект.ЗначениеУсловия = Справочники.ТипыПодписей.ОписаниеТипаЗначенияУсловия(Объект).ПривестиЗначение(Объект.ЗначениеУсловия);
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры // УсловиеПриИзмененииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры
